[
  {"verse": "Ask, and it shall be given to you. Seek, and you shall find. Knock, and it shall be opened to you. For everyone who asks, receives; and whoever seeks, finds; and to anyone who knocks, it will be opened. (Matt 7:7-8)", "decade": 1},
  {"verse": "My Spirit is within you, and my words, which I have put in your mouth, will not withdraw from your mouth, nor from the mouth of your offspring, nor from the mouth of your offspring’s offspring, says the Lord, from this moment, and even forever. (Is 59:21)", "decade": 1},
  {"verse": "The Advocate, the Holy Spirit, whom the Father will send in my name, will teach you all things and will remind you everything whatsoever that I have said to you. (Jn 14:26)", "decade": 1},
  {"verse": "When the Spirit of truth has arrived, he will teach the whole truth to you. For he will not be speaking from himself. Instead, whatever he will hear, he will speak. And he will announce to you the things that are to come. (Jn 16:13)", "decade": 1},
  {"verse": "You will receive power when the Holy Spirit comes on you; and you will be my witnesses in Jerusalem, and in all Judea and Samaria, and to the ends of the earth. (Acts 1:8)", "decade": 1},
  {"verse": "Jesus was standing and crying out, saying: \"If anyone thirsts, let him come to me and drink: whoever believes in me, just as Scripture says, ‘From his heart shall flow rivers of living water.’\" Now he said this about the Spirit, which those who believe in him would soon be receiving. (Jn 7:37-39)", "decade": 1},
  {"verse": "Whoever shall drink from the water that I will give to him will not thirst for eternity. Instead, the water that I will give to him will become in him a fountain of water, springing up into eternal life. (Jn 4:14)", "decade": 1},
  {"verse": "I will put my Spirit in you, and you will live. And I will settle you in your own soil. Then you shall know that I, the Lord, have spoken, and done it, says the Lord God. (Eze 37:14)", "decade": 1},
  {"verse": "Not by might, nor by power, but by my spirit, says the Lord of hosts. (Zech 4:6)", "decade": 1},
  {"verse": "Who has learned your will, unless you have given him wisdom and sent your Holy Spirit from above. (Wis 9:17)", "decade": 1},

  {"verse": "The Spirit helps us in our weakness; For we know not what we should pray for as we ought, but the Spirit himself intercedes with groanings that words cannot express. (Rom 8:26)", "decade": 2},
  {"verse": "He who examines hearts knows what the Spirit seeks, because he asks on behalf of the saints in accordance with God. (Rom 8:27)", "decade": 2},
  {"verse": "Those who base their lives according to the flesh set their minds on the things of the flesh. But those who live according to the Spirit set their minds on the things of the Spirit. (Rom 8:5)", "decade": 2},
  {"verse": "The mind set on the flesh is death, but the mind set on the Spirit is life and peace. (Rom 8:6)", "decade": 2},
  {"verse": "If the Spirit of him who raised up Jesus from the dead lives within you, then he who raised up Jesus Christ from the dead shall also enliven your mortal bodies, by means of his Spirit living within you. (Rom 8:11)", "decade": 2},
  {"verse": "If you live according to the flesh, you will die. But if, by the Spirit, you mortify the deeds of the flesh, you shall live. (Rom 8:13)", "decade": 2},
  {"verse": "Those who are led by the Spirit of God are God's children. (Rom 8:14)", "decade": 2},
  {"verse": "No one speaking in the Spirit of God utters a curse against Jesus. And no one is able to say that Jesus is Lord, except in the Holy Spirit. (1 Cor 12:3)", "decade": 2},
  {"verse": "Anyone who will have spoken a word against the Son of man shall be forgiven. But whoever will have spoken against the Holy Spirit shall not be forgiven, neither in this age, nor in the future age. (Matt 12:32)", "decade": 2},
  {"verse": "The Spirit of the Lord will rest upon him: the spirit of wisdom and understanding, the spirit of counsel and fortitude, the spirit of knowledge and piety. And he will be filled with the spirit of the fear of the Lord. (Is 11:2-3)", "decade": 2},

  {"verse": "Do not worry about what you are to say or how you will say it; when it is time, you will be given what you are to say. For it is not you who speak, but the Spirit of your Father speaking through you. (Matt 10:19-20)", "decade": 3},
  {"verse": "Do not get drunk with wine, which will only ruin you; instead, be filled with the Spirit. Speaking to one another in psalms and hymns and spiritual songs, singing and making melody in your heart to the Lord. (Eph 5:18-19)", "decade": 3},
  {"verse": "Indeed, in one Spirit, we were all baptized into one body, whether Jews or Gentiles, whether slave or free. And we were all given to drink of one Spirit. (1 Cor 12:13)", "decade": 3},
  {"verse": "Since you are zealous for spiritual gifts, seek to excel in them to build up the church. (1 Cor 14:12)", "decade": 3},
  {"verse": "I will ask the Father, and he will give another advocate to you, so that he may abide with you for ever. (Jn 14:16)", "decade": 3},
  {"verse": "He is the Spirit of truth, whom the world cannot receive, because it cannot see him or know him. But you know him, because he remains with you and is in you. (Jn 14:17)", "decade": 3},
  {"verse": "Because we are his children, God sent the Spirit of his Son into our hearts, crying, \"Abba, Father.\" (Gal 4:6)", "decade": 3},
  {"verse": "The manifestation of the Spirit is given to each one toward what is beneficial. Certainly, to one, through the Spirit, is given the word of wisdom; but to another, according to the same Spirit, the word of knowledge; to another, in the same Spirit, faith; to another, in the one Spirit, the gift of healing; to another, working of miracles; to another, prophecy; to another, the discernment of spirits; to another, different kinds of tongues; to another, the interpretation of tongues. (1 Cor 12:7-10)", "decade": 3},
  {"verse": "The fruit of the Spirit is love, joy, peace, patience, kindness, generosity, faithfulness, gentleness, and self-control. (Gal 5:22-23)", "decade": 3},
  {"verse": "If we live by the Spirit, let us also walk in the Spirit. (Gal 5:25)", "decade": 3},

  {"verse": "Those who keep his commandments abide in him, and he in them. And we know that he abides in us by this: by the Spirit, whom he has given to us. (1 Jn 3:24)", "decade": 4},
  {"verse": "By this we know that we dwell in Him and He in us: because He has given us of His Spirit. (1 Jn 4:13)", "decade": 4},
  {"verse": "He whom God has sent speaks God’s words, for God gives the Spirit without measure. (Jn 3:34)", "decade": 4},
  {"verse": "Pray at all times in the Spirit with every prayer and request. Stay alert with all perseverance and supplication for all the saints. (Eph 6:18)", "decade": 4},
  {"verse": "Repent and be baptized, each one of you, in the name of Jesus Christ, so that God will forgive your sins; and you will receive the gift of the Holy Spirit. (Acts 2:38)", "decade": 4},
  {"verse": "If you then, being evil, know how to give good gifts to your children, how much more will your heavenly Father give the Holy Spirit to those who ask him! (Luk 11:13)", "decade": 4},
  {"verse": "It is better for you that I go away, for if I do not go away, the Helper will not come to you. But if I do go, then I will send him to you. And when he comes, he will prove the world that they are wrong about sin and about righteousness and about God's judgment. (Jn 16:7-8)", "decade": 4},
  {"verse": "When the Advocate comes, whom I will send to you from the Father, the Spirit of truth who proceeds from the Father, he will testify about me. (Jn 15:26)", "decade": 4},
  {"verse": "You gave them your good Spirit, so that He might teach them. (Neh 9:20)", "decade": 4},
  {"verse": "Grieve not the Holy Spirit of God, with which you were sealed for the day of redemption. (Eph 4:30)", "decade": 4},

  {"verse": "But as for you, let the Anointing that you have received from him abide in you. And so, you have no need of anyone to teach you. For his Anointing teaches you about everything, and it is the truth, and it is not a lie. And just as his Anointing has taught you, abide in him. (1 Jn 2:27)", "decade": 5},
  {"verse": "In him, you also, after you heard and believed the Word of truth, which is the Gospel of your salvation, were sealed with the promised Holy Spirit. (Eph 1:13)", "decade": 5},
  {"verse": "I will pour out waters upon the thirsty ground, and rivers upon the dry land. I will pour out my Spirit upon your offspring, and my blessing upon your descendants. (Is 44:3)", "decade": 5},
  {"verse": "To those who thirst, I will give freely from the fountain of the water of life. (Rev 21:6)", "decade": 5},
  {"verse": "This is what I will do in the last days, God says: I will pour out my Spirit on everyone. Your sons and daughters shall prophecy; your young men will see visions, and your old men will have dreams. (Acts 2:17)", "decade": 5},
  {"verse": "God poured out the Holy Spirit abundantly on us through Jesus Christ our Savior, so that by his grace we might be put right with God and come into possession of the eternal life we hope for. (Tit 3:6-7)", "decade": 5},
  {"verse": "The eye has not seen, and the ear has not heard, nor has it entered into the heart of man, what things God has prepared for those who love him. But God has revealed these things to us through his Spirit. For the Spirit searches all things, even the depths of God. (1 Cor 2:9-10)", "decade": 5},
  {"verse": "Who can know the things that are of a man, except the spirit which is within that man? So also, no one knows the things which are of God, except the Spirit of God. (1 Cor 2:11)", "decade": 5},
  {"verse": "We have not received the spirit of this world, but the Spirit who is of God, so that we may understand the things that have been given to us by God. (1 Cor 2:12)", "decade": 5},
  {"verse": "We speak of these things, not in the learned words of human wisdom; but taught by the Spirit, interpreting spiritual things to the spiritual. (1 Cor 2:13)", "decade": 5}
]

