 [
   {"verse": "In the sixth month, the Angel Gabriel was sent by God, to a city of Galilee named Nazareth, to a virgin betrothed to a man whose name was Joseph, of the house of David; and the name of the virgin was Mary. (Luk 1:26-27)", "decade": 1},
   {"verse": "Upon entering, the Angel said to her: “Hail, full of grace. The Lord is with you. Blessed are you among women.” (Luk 1:28)", "decade": 1},
   {"verse": "When she had heard this, she was disturbed by his words, and she considered what kind of greeting this might be. (Luk 1:29)", "decade": 1},
   {"verse": "The Angel said to her: “Do not be afraid, Mary, for you have found favor with God.” (Luk 1:30)", "decade": 1},
   {"verse": "Behold, you shall conceive in your womb, and you shall bear a son, and you shall call his name Jesus. (Luk 1:31)", "decade": 1},
   {"verse": "He will be great, and he will be called the Son of the Most High, and the Lord God will give him the throne of David his father. And he will reign in the house of Jacob for eternity. And his kingdom shall have no end. (Luk 1:32-33)", "decade": 1},
   {"verse": "Mary said to the angel, “I am a virgin. How, then, can this be?” (Luk 1:34, GNT)", "decade": 1},
   {"verse": "The angel said to her, “The Holy Spirit will come upon you, and the power of the Most High will overshadow you.” (Luk 1:35, NRSVCE)", "decade": 1},
   {"verse": "Therefore the child who shall be born will be holy and he shall be called the Son of God. (Luk 1:35)", "decade": 1},
   {"verse": "Then Mary said: “Behold, I am the handmaid of the Lord. Let it be done to me according to your word.” And the Angel departed from her. (Luk 1:38)", "decade": 1},

   {"verse": "In those days, Mary, rising up, traveled quickly into the hill country, to a city of Judah. And she entered into the house of Zechariah, and she greeted Elizabeth. (Luk 1:39-40)", "decade": 2},
   {"verse": "As Elizabeth heard the greeting of Mary, the baby leaped in her womb, and Elizabeth was filled with the Holy Spirit. (Luk 1:41)", "decade": 2},
   {"verse": "Elizabeth was filled with the Holy Spirit. And she cried out with a loud voice and said: “Blessed are you among women, and blessed is the fruit of your womb.” (Luk 1:41-42)", "decade": 2},
   {"verse": "Blessed are you who believed, for the things that were spoken to you by the Lord shall be accomplished. (Luk 1:45)", "decade": 2},
   {"verse": "Mary said: “My soul magnifies the Lord.” (Luk 1:46)", "decade": 2},
   {"verse": "My spirit leaps for joy in God my Savior. (Luk 1:47)", "decade": 2},
   {"verse": "He has looked with favor on the humility of his handmaid. (Luk 1:48)", "decade": 2},
   {"verse": "Behold, from this time, all generations shall call me blessed. (Luk 1:48)", "decade": 2},
   {"verse": "He has stretched out his mighty arm and he has scattered the proud in the thoughts of their hearts. (Luk 1:51)", "decade": 2},
   {"verse": "He has filled the hungry with good things, and the rich he has sent away empty. (Luk 1:53)", "decade": 2},

   {"verse": "While they were in Bethlehem, the time came for her to have her baby. (Luk 2:6)", "decade": 3},
   {"verse": "She brought forth her firstborn son. And she wrapped him in swaddling clothes. (Luk 2:7)", "decade": 3},
   {"verse": "She wrapped him in swaddling clothes and laid him in a manger, because there was no room for them at the inn. (Luk 2:7)", "decade": 3},
   {"verse": "There were some shepherds living in that part of the country, keeping the night watches over their flock. An angel of the Lord stood by them, and the glory of God shone round them, and they were terribly afraid. (Luk 2:8-9)", "decade": 3},
   {"verse": "The Angel said to them: “Do not be afraid. For, behold, I proclaim to you good news of great joy, which will be for all the people. (Luk 2:10)", "decade": 3},
   {"verse": "For today a Savior has been born for you in the city of David: he is the Messiah, the Lord. (Luk 2:11)", "decade": 3},
   {"verse": "Glory to God in the highest, and on earth peace to those whom he favors. (Luk 2:14)", "decade": 3},
   {"verse": "After the angels departed from them into heaven, the shepherds said one to another, “Let us go over to Bethlehem, and let us see this thing that has taken place, which the Lord has told us.” (Luk 2:15)", "decade": 3},
   {"verse": "When Jesus had been born in Bethlehem of Judah, in the days of king Herod, behold, Magi from the east arrived in Jerusalem. (Matt 2:1)", "decade": 3},
   {"verse": "Entering the home, they found the boy with his mother Mary. And so, falling prostrate, they adored him. And opening their treasures, they offered him gifts: gold, frankincense, and myrrh. (Matt 2:11)", "decade": 3},

   {"verse": "When it was time for their purification, according to the law of Moses, they brought him to Jerusalem, to present him to the Lord. (Luk 2:22)", "decade": 4},
   {"verse": "There was a man in Jerusalem, whose name was Simeon, and this man was righteous and God-fearing, awaiting the consolation of Israel. And the Holy Spirit was upon him. (Luk 2:25)", "decade": 4},
   {"verse": "The Holy Spirit was with him and had assured him that he would not die before he had seen the Lord's promised Messiah. (Luk 2:25-26)", "decade": 4},
   {"verse": "He went to the temple, guided by the Holy Spirit. And when the child Jesus was brought in by his parents, in order to do for him according to the custom of the law, Simeon took him up, into his arms, and he praised God. (Luk 2:27-28)", "decade": 4},
   {"verse": "Now you may dismiss your servant in peace, O Lord, according to your word. (Luk 2:29)", "decade": 4},
   {"verse": "My eyes have seen your salvation, which you have prepared before the face of all peoples. (Luk 2:30-31)", "decade": 4},
   {"verse": "The light of revelation to the nations and the glory of your people Israel. (Luk 2:32)", "decade": 4},
   {"verse": "Simeon blessed them, and said to Mary his mother: Behold this child is destined for the fall, and for the rise of many in Israel, and to be a sign which will be contradicted. (Luk 2:34)", "decade": 4},
   {"verse": "After they had performed all things according to the law of the Lord, they returned to Galilee, to their city, Nazareth. (Luk 2:39)", "decade": 4},
   {"verse": "The child grew, and he was strengthened with the fullness of wisdom. And the grace of God was in him. (Luk 2:40)", "decade": 4},

   {"verse": "His parents went every year to Jerusalem, for the solemn festival of the Passover, and when Jesus was twelve years old, they went to the festival as usual. (Luk 2:41-42)", "decade": 5},
   {"verse": "After the festival, they started back home, but the child Jesus remained in Jerusalem; and his parents did not know this. (Luk 2:43)", "decade": 5},
   {"verse": "Thinking that he was in the group, they travelled a whole day's journey, and then started searching for him among their relatives and friends. And not finding him, they returned to Jerusalem, searching for him. (Luk 2:44-45)", "decade": 5},
   {"verse": "After three days, they found him in the temple, sitting in the midst of the teachers, listening to them and asking them questions. (Luk 2:46)", "decade": 5},
   {"verse": "All who listened to him were astonished over his prudence and his responses. (Luk 2:47)", "decade": 5},
   {"verse": "Upon seeing him, they wondered. And his mother said to him: “Son, why have you acted this way toward us? Behold, your father and I were seeking you in sorrow.” (Luk 2:48)", "decade": 5},
   {"verse": "He said to them, “Why did you search for me? did you not know that I must be in my father's house?” (Luk 2:49)", "decade": 5},
   {"verse": "They did not understand the word that he spoke to them. (Luk 2:50)", "decade": 5},
   {"verse": "He went with them and came to Nazareth. And he was obedient to them. And his mother kept all these things in her heart. (Luk 2:51)", "decade": 5},
   {"verse": "Jesus advanced in wisdom, and in age, and in grace, with God and men. (Luk 2:52)", "decade": 5}
 ]

